app/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          32;
        startFace       187744;
    }
    outlet
    {
        type            patch;
        nFaces          32;
        startFace       187776;
    }
    force
    {
        type            patch;
        nFaces          3200;
        startFace       187808;
    }
    wall
    {
        type            patch;
        nFaces          3328;
        startFace       191008;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4992;
        startFace       194336;
    }
)

// ************************************************************************* //
