app/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

nu                           nu [0 2 -1 0 0 0 0] 1.0e-6;//流体粘度
alphaMax               alphaMax [0 0 -1 0 0 0 0] 2.5e3;//初始流阻系数
alphaMAX               alphaMAX [0 0 -1 0 0 0 0] 2.5e7;//最大流阻系数
/*
alphamax=nu/(L^2*Da)=1e-6/(2e-3)^2/Da=1/(4*Da)
Da=10^-4, alphamax=2.5e3;
Da=10^-7, alphamax=2.5e6;
1.05^140=926
*/



